In [3]:
from datetime import datetime

date1 = datetime(2023, 9,12)
date1

datetime.datetime(2023, 9, 12, 0, 0)

In [6]:
date2 = datetime(2023, 9,12,15,33,30)
date2

datetime.datetime(2023, 9, 12, 15, 33, 30)

In [8]:
print(date2.year)
print(date2.month)
print(date2.day)
print(date2.hour)

2023
9
12
15

In [12]:
print(date2.weekday()) #월요일 :0
# print(date2.weekday()) #월요일 :0

1

In [14]:
import pandas as pd

date3 = '2023-09-12'
datetime_date3 = pd.to_datetime(date3)

print(datetime_date3.year)
print(datetime_date3.quarter)

2023
3

https://docs.python.org/3/library/datetime.html

In [18]:
datetime_date3.strftime('%Y-%m')

'2023-09'

In [23]:
date4 = '23-01-01' # 2023-01-01 
print(pd.to_datetime(date4))
print(pd.to_datetime(date4, format='%y-%m-%d'))

2001-01-23 00:00:00
2023-01-01 00:00:00

In [30]:
date5 = '2/2/2020'
date6 = 'Jan 01, 2018'
date5 = pd.to_datetime(date5, format='%d/%m/%Y')
date6 = pd.to_datetime(date6, format='%b %d, %Y')
print(date5)
print(date6)

2020-02-02 00:00:00
2018-01-01 00:00:00

In [31]:
AAPL = pd.read_csv('https://raw.githubusercontent.com/jin0choi1216/dataset/main/AAPL.csv')
AAPL.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2012-01-03,14.621429,14.732143,14.607143,14.686786,12.466090,302220800
1,2012-01-04,14.642857,14.810000,14.617143,14.765714,12.533089,260022000
2,2012-01-05,14.819643,14.948214,14.738214,14.929643,12.672229,271269600
3,2012-01-06,14.991786,15.098214,14.972143,15.085714,12.804703,318292800
4,2012-01-09,15.196429,15.276786,15.048214,15.061786,12.784389,394024400

In [33]:
AAPL['Date'] = pd.to_datetime(AAPL['Date'])

In [34]:
AAPL.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2931 entries, 0 to 2930
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       2931 non-null   datetime64[ns]
 1   Open       2931 non-null   float64
 2   High       2931 non-null   float64
 3   Low        2931 non-null   float64
 4   Close      2931 non-null   float64
 5   Adj Close  2931 non-null   float64
 6   Volume     2931 non-null   int64
dtypes: datetime64[ns](1), float64(5), int64(1)
memory usage: 160.4 KB

In [40]:
AAPL['Year'] = AAPL['Date'].dt.year
AAPL['Month'] = AAPL['Date'].dt.month
AAPL['Day'] = AAPL['Date'].dt.day
AAPL.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Year,Month,Day
0,2012-01-03,14.621429,14.732143,14.607143,14.686786,12.466090,302220800,2012,1,3
1,2012-01-04,14.642857,14.810000,14.617143,14.765714,12.533089,260022000,2012,1,4
2,2012-01-05,14.819643,14.948214,14.738214,14.929643,12.672229,271269600,2012,1,5
3,2012-01-06,14.991786,15.098214,14.972143,15.085714,12.804703,318292800,2012,1,6
4,2012-01-09,15.196429,15.276786,15.048214,15.061786,12.784389,394024400,2012,1,9

In [55]:
# AAPL['Close'].iloc[1:].reset_index(drop=True) - AAPL['Close'].iloc[:-1] # 이걸 줄여서
AAPL['Close'].diff()

0            NaN
1       0.078928
2       0.163929
3       0.156071
4      -0.023928
          ...
2926    1.349991
2927    1.390000
2928    3.889999
2929   -4.739990
2930    2.229996
Name: Close, Length: 2931, dtype: float64

In [56]:
AAPL['Close'].pct_change()

0            NaN
1       0.005374
2       0.011102
3       0.010454
4      -0.001586
          ...
2926    0.007737
2927    0.007905
2928    0.021949
2929   -0.026170
2930    0.012643
Name: Close, Length: 2931, dtype: float64

In [57]:
AAPL['Close_shift1'] = AAPL['Close'].shift(1)
AAPL.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Year,Month,Day,Close_shift1
0,2012-01-03,14.621429,14.732143,14.607143,14.686786,12.466090,302220800,2012,1,3,NaN
1,2012-01-04,14.642857,14.810000,14.617143,14.765714,12.533089,260022000,2012,1,4,14.686786
2,2012-01-05,14.819643,14.948214,14.738214,14.929643,12.672229,271269600,2012,1,5,14.765714
3,2012-01-06,14.991786,15.098214,14.972143,15.085714,12.804703,318292800,2012,1,6,14.929643
4,2012-01-09,15.196429,15.276786,15.048214,15.061786,12.784389,394024400,2012,1,9,15.085714

In [61]:
AAPL['ex_mean'] = AAPL['Close'].expanding().mean() # 누적평균 
AAPL['MA5'] = AAPL['Close'].rolling(window=5).mean() # 이동평균(window_size = 5)
AAPL.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Year,Month,Day,Close_shift1,ex_mean,MA5
0,2012-01-03,14.621429,14.732143,14.607143,14.686786,12.466090,302220800,2012,1,3,NaN,14.686786,NaN
1,2012-01-04,14.642857,14.810000,14.617143,14.765714,12.533089,260022000,2012,1,4,14.686786,14.726250,NaN
2,2012-01-05,14.819643,14.948214,14.738214,14.929643,12.672229,271269600,2012,1,5,14.765714,14.794048,NaN
3,2012-01-06,14.991786,15.098214,14.972143,15.085714,12.804703,318292800,2012,1,6,14.929643,14.866964,NaN
4,2012-01-09,15.196429,15.276786,15.048214,15.061786,12.784389,394024400,2012,1,9,15.085714,14.905929,14.905929